# Тестовое задание на позицию Game Data analyst

Для выполнения данного задания предлагается использовать следующую структуру данных:

*	Таблица "users" с полями: id, name, email, created_at

*	Таблица "orders" с полями: id, user_id, total_price, created_at

*	Таблица "order_items" с полями: id, order_id, product_name, price, quantity

В ответе пришлите имя и версию используемой бд, дамп структуры базы, а также запросы для заполнения тестовыми данными, в работе строк должно быть не менее 1 млн в каждой таблице.
Ответ должен представлять из себя SQL запрос с пояснением. По желанию можете дополнить ваш ответ плохим вариантом запроса также с объяснением.

Запросы:

1.	Найти общее количество заказов каждого пользователя, который сделал более 10 заказов.

2.	Найти средний размер заказа для каждого пользователя за последний месяц.

3.	Найти средний размер заказа за каждый месяц в текущем году и сравнить его с средним размером заказа за соответствующий месяц в прошлом году.

4.	Найти 10 пользователей, у которых наибольшее количество заказов за последний год, и для каждого из них найти средний размер заказа за последний месяц.

_____________________________________________________________________

### 1. Сгенерируем синтетические данные для выполнения данного задания


File: 02 synthetic_data_generating.ipynb


_____________________________________________________________________________

### 2. Зальём полученные данные в БД

Имя и версия используемой бд: <span style="color:#FF7F50"> **PostgreSQL 16.4**</span> 

Дамп структуры базы данных в File: <span style="color:#FF7F50"> **schema_dump.sql**</span>

##### Шаг 1. С помощью визуального редактора для PostgresSQL программы PgAdmin создадим БД "happy_games".

##### Шаг 2. Создадим необходимые таблицы

In [1]:
# 1. Импортируем необходимые библиотеки.
import pandas as pd
import numpy as np
import psycopg2 as ps
from sqlalchemy import create_engine, text

In [2]:
# 1. Создадим новое подключение к БД через sqlalchemy
conn = create_engine('postgresql+psycopg2://postgres:maz505+5@localhost:5432/happy_games')

In [3]:
# Функция для выполнения запросов на изменение структуры БД
def execute_query(sql):
    with conn.connect() as connection:
        connection.execute(text(sql))
        connection.commit()

# Функция для выполнения SELECT-запросов
def select(sql):
    with conn.connect() as connection:
        return pd.read_sql(sql, connection)

In [4]:
# 4. Создадим нашу первую таблицу "users"  со следующей структурой данных:
#      id: SERIAL PRIMARY KEY
#      name: VARCHAR(50) 
#      email: VARCHAR(50)
#      created_at: DATE

sql = """CREATE TABLE IF NOT EXISTS users (
               id SERIAL PRIMARY KEY, 
               name VARCHAR(50), 
               email VARCHAR(60) UNIQUE, 
               created_at DATE)
       """
execute_query(sql)

In [5]:
# 5. Аналогично создадим  таблицу "orders" со следующей структурой данных:
#      id: SERIAL PRIMARY KEY
#      user_id: INTEGER NOT NULL
#      total_price: NUMERIC(10, 2)
#      created_at: DATE
#      FOREIGN KEY (user_id) REFERENCES users (id)

sql = """CREATE TABLE IF NOT EXISTS orders (
               id SERIAL PRIMARY KEY, 
               user_id INTEGER NOT NULL, 
               total_price NUMERIC(10, 2), 
               created_at DATE, 
               FOREIGN KEY (user_id) REFERENCES users(id))
      """

execute_query(sql)

In [6]:
# 6. Создадим таблицу order_items со следующей структурой данных:
#       id: SERIAL PRIMARY KEY
#       order_id: INTEGER NOT NULL
#       product_name: VARCHAR(50) 
#       price: NUMERIC(10, 2) 
#       quantity: INTEGER 
#       FOREIGN KEY (order_id) REFERENCES orders (id)
sql = """CREATE TABLE IF NOT EXISTS order_items (
               id SERIAL PRIMARY KEY, 
               order_id INTEGER NOT NULL, 
               product_name VARCHAR(50), 
               price NUMERIC(10, 2), 
               quantity INTEGER, 
               FOREIGN KEY (order_id) REFERENCES orders (id))
      """
execute_query(sql)

#### Шаг 3. Приступим к заполнению таблиц

In [7]:
# 2. Метод для ускорения процесса записи данных (https://stackoverflow.com/a/55495065/4527289)

import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [8]:
# 3. Считываем ранее сгенерированные данные, а именно users.csv.
#    Так как колонка 'id' у нас будет являться первичным ключом, и мы при создании таблицы на предыдущем шаге 
#    устанавили параметры для неё SERIAL PRIMARY KEY, избавимся от колонок 'id' в наших датафреймах.
df_users = pd.read_csv('users.csv', parse_dates=['created_at'])
df_users.head(2)

            name                           email created_at
0  Chelsey White  chelsey.white0@googlyandex.com 2023-01-01
1  Gregory Allen  gregory.allen1@googlyandex.com 2023-01-01

In [9]:
# 4. Используем метод to_sql() у объекта DataFrame для вставки данных в таблицу базы данных.
df_users.to_sql('users', conn, if_exists='append', index=False, method=psql_insert_copy)

In [10]:
# Проверим, сделав первый запрос.
sql = '''SELECT * FROM users LIMIT 5'''
select(sql)

   id           name                           email  created_at
0   1  Chelsey White  chelsey.white0@googlyandex.com  2023-01-01
1   2  Gregory Allen  gregory.allen1@googlyandex.com  2023-01-01
2   3   Rachel Jones   rachel.jones2@googlyandex.com  2023-01-01
3   4    James Evans    james.evans3@googlyandex.com  2023-01-01
4   5   Sarah Fisher   sarah.fisher4@googlyandex.com  2023-01-01

In [11]:
# 5. Считываем ранее сгенерированный файл orders.csv.
df_orders = pd.read_csv('orders.csv', parse_dates=['created_at'])
df_orders.head(2)

   user_id created_at  total_price
0     2774 2023-01-29        18090
1     2686 2023-01-29         1320

In [12]:
# 6. Используем метод to_sql() у объекта DataFrame для вставки данных в таблицу базы данных.
df_orders.to_sql('orders', conn, if_exists='append', index=False, method=psql_insert_copy)

In [13]:
# Проверим, сделав запрос.
sql = '''SELECT * FROM orders LIMIT 5'''
select(sql)

   id  user_id  total_price  created_at
0   1     2774      18090.0  2023-01-29
1   2     2686       1320.0  2023-01-29
2   3     2147        340.0  2023-01-29
3   4       97        450.0  2023-01-29
4   5     1924      12710.0  2023-01-29

In [14]:
# 7. По аналогии с предыдущими шагами.
df_order_items = pd.read_csv('order_items.csv')

df_order_items.head(2)

   order_id           product_name  price  quantity
0         1  Prod.№: kDOe-12612877    270        67
1         2  Prod.№: jMCN-28203691    165         8

In [15]:
df_order_items.to_sql('order_items', conn, if_exists='append', index=False, method=psql_insert_copy)

In [16]:
sql = '''SELECT * FROM order_items LIMIT 5'''
select(sql)

   id  order_id           product_name  price  quantity
0   1         1  Prod.№: kDOe-12612877  270.0        67
1   2         2  Prod.№: jMCN-28203691  165.0         8
2   3         3  Prod.№: NqEu-83181983   10.0        34
3   4         4  Prod.№: ELjg-02215747   50.0         9
4   5         5  Prod.№: ZlNz-37570014  310.0        41

__________________________________________________


### 3. Приступим к составлению запросов, для ответов на поставленные вопросы

1. Найти общее количество заказов каждого пользователя, который сделал более 10 заказов.
   
   Таблица "orders" с полями: id, user_id, total_price, created_at

In [17]:
# ⚠️ Не оптимальные запросы ❗️❗️❗️

# 1ый вариант с использованием CTE ❌
sql1 = '''
WITH cte AS (SELECT o.user_id AS user_id
               FROM orders o                
              GROUP BY 1
             HAVING count(distinct o.id) > 10
             )
             
  SELECT o.user_id, u.name, u.email,
         COUNT(DISTINCT o.id)  AS cnt_orders       
    FROM orders o JOIN cte 
         ON o.user_id = cte.user_id
                  JOIN users u
         ON o.user_id = u.id
   GROUP BY 1, 2, 3
       '''
# Этот запрос использует CTE для выбора всех пользователей, у которых есть более 10 заказов. 
# Затем, запрос присоединяет этих пользователей к таблице orders с помощью INNER JOIN, 
# тем самым отбирая только нужные нам данные.
# Если есть необходимость, то ещё джойним таблицу users и получаем подробную информацию по юзерам.
# Так же эту задачу можно решить используя подзапрос вместо CTE.

# 2ой вариант с использованием подзапроса в JOIN ❌
sql2 = '''
     SELECT o.user_id, u.name, u.email,
            COUNT(DISTINCT o.id)  AS cnt_orders       
       FROM orders o
            JOIN                                      
                 (SELECT o.user_id AS user_id
                    FROM orders o                
                   GROUP BY 1
                  HAVING count(distinct o.id) > 10
                  ) AS q 
              ON o.user_id = q.user_id
            JOIN users u
              ON o.user_id = u.id
     GROUP BY 1, 2, 3
       '''
# Аналогичен первому, фильтрует пользователей через подзапрос в JOIN, а затем выполняет агрегирование.

# 3ий вариант с использованием подзапроса в JOIN и оконных функций ❌
sql3 = '''
SELECT q.user_id, u.name, u.email,
       q.total_cnt_orders
  FROM
       (SELECT o.user_id AS user_id,
               o.id AS order_id,
               COUNT(o.id) OVER (PARTITION BY o.user_id) AS total_cnt_orders
          FROM orders o
        ) AS q
        JOIN users u
              ON q.user_id = u.id
 WHERE q.total_cnt_orders > 10
 GROUP BY 1, 2, 3, 4
'''
# Рассчитывает количество заказов для каждого пользователя с использованием оконной функции и отбирает пользователей с более чем 10 заказами через фильтр WHERE.
# Однако, оконные функции могут быть более ресурсоемкими, так как они подсчитывают данные для каждой строки, а затем выполняется фильтрация.
# Все три запроса содержат дополнительные операции для выполнения фильтрации через отдельный набор данных (CTE или подзапрос).
# Но, здесь нет реальной необходимости в использовании CTE/подзапроса, поскольку мы можем выполнить фильтрацию непосредственно в основном запросе.
# В общем, это первоначальные и не самые оптимальные версии запроса, попробуем их оптимизировать и получим:

# ---------------------------------------------------------------------------------------------------------------------------------------------

#  Оптимальный запрос 🚀🔥✅
# 4ый вариант без CTE и подзапроса

sql4 = '''
SELECT o.user_id, u.name, u.email,
       COUNT(DISTINCT o.id) AS cnt_orders
  FROM orders o
       JOIN users u
         ON o.user_id = u.id
 GROUP BY o.user_id, u.name, u.email
HAVING COUNT(DISTINCT o.id) > 10;
      '''

print(f'1ая версия запроса с использованием CTE ❌:\n{select(sql1).head(3)}')
print('------------------     ------------------     ------------------')
print(f'2ой вариант запроса с использованием CTE ❌:\n{select(sql2).head(3)}')
print('------------------     ------------------     ------------------')
print(f'3ий вариант с использованием подзапроса в JOIN и оконных функций ❌:\n{select(sql3).head(3)}')
print('------------------     ------------------     ------------------')
print(f'4ый вариант запроса без CTE ✅:\n{select(sql4).head(3)}')

1ая версия запроса с использованием CTE ❌:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   cnt_orders
0          11
1          11
2          11
------------------     ------------------     ------------------
2ой вариант запроса с использованием CTE ❌:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   cnt_orders
0          11
1          11
2          11
------------------     ------------------     ------------------
3ий вариант с использованием подзапроса в JOIN и оконных функций ❌:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   total_cnt_orders
0                11
1                11
2                11
------------------     ------------------     ------------------
4ый вариант запроса без CTE ✅:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   cnt_orders
0          11
1          11
2          11

_______________________________________

2. Найти средний размер заказа для каждого пользователя за последний месяц.  
Последний месяц: июль 2024.

In [18]:
# ⚠️ Не оптимальные запросы ❗️❗️❗️

# 1ый вариант❌:
sql1 = ''' 
SELECT user_id,
       ROUND(AVG(total_price),2) AS avg_total_price
  FROM orders
 WHERE to_char(created_at, 'MM-YYYY') = '08-2024' 
 GROUP BY 1
       '''
#⚠️ Применение функции (to_char()) к полю в фильтре мешает использованию индекса.

# 2ой вариант (оконные функции) ❌:
sql2 = ''' 
SELECT DISTINCT user_id,
       ROUND(AVG(orders.total_price) OVER (PARTITION BY user_id), 2) AS avg_total_price
  FROM orders
 WHERE created_at >= '2024-08-01' 
   AND created_at < '2024-09-01'
       '''
# Оконные функции могут быть более ресурсоемкими, так как они подсчитывают данные для каждой строки, а затем выполняется фильтрация.

# ---------------------------------------------------------------------------------------------------------------------------------------------

#  Оптимальный запрос 🚀🔥✅
#  3ий вариант :
sql3 = ''' 
SELECT user_id,
       ROUND(AVG(total_price), 2) AS avg_total_price
  FROM orders
 WHERE created_at >= '2024-08-01' 
   AND created_at < '2024-09-01'
 GROUP BY user_id;
      ''' 


print(f'1ый вариант❌:\n{select(sql1).head(3)}')
print('------------------     ------------------')
print(f'2ой вариант (оконные функции) ❌:\n{select(sql2).head(3)}')
print('------------------     ------------------')
print(f'3ий вариант. Оптимальный запрос 🚀🔥✅:\n{select(sql3).head(3)}')

1ый вариант❌:
   user_id  avg_total_price
0  2155350          4673.33
1  2155351         11495.00
2  2155352         12632.50
------------------     ------------------
2ой вариант (оконные функции) ❌:
   user_id  avg_total_price
0  2155350          4673.33
1  2155351         11495.00
2  2155352         12632.50
------------------     ------------------
3ий вариант. Оптимальный запрос 🚀🔥✅:
   user_id  avg_total_price
0  2155350          4673.33
1  2155351         11495.00
2  2155352         12632.50

_______________________________________

3. Найти средний размер заказа за каждый месяц в текущем году и сравнить его с средним размером заказа за соответствующий месяц в прошлом году.

In [19]:
# 1ый вариант (оконные функции) ✅:
# 1. На первом этапе решения данной задачи вычленим из даты 'created_at' год и месяц, 
# 2. затем данные отсортируем сначала по году, затем по месяцу.

# 3. Доработаем предыдущий запрос, добавив оконную функцию смещения LAG.
# 4. Дабы избежать подзапросов поместим наш запрос в CTE.
# 5. Отберём строки с текущим годом.
# 6. Рассчитаем разницу (абсолютный прирост / темп роста )


sql = ''' 
WITH cte AS (
             SELECT 
                CAST(EXTRACT(YEAR FROM created_at) AS INTEGER) AS year,
                CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) AS month,
                ROUND(AVG(total_price), 2) AS avg_money_2024,
                LAG(ROUND(AVG(total_price), 2)) OVER(PARTITION BY  CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) ORDER BY CAST(EXTRACT(YEAR FROM created_at) AS INTEGER)) AS last_year_avg_money
             FROM orders
             GROUP BY 1, 2
             ORDER BY 2, 1 ASC
           )

SELECT month,
       avg_money_2024,
       last_year_avg_money AS avg_money_2023,
       (avg_money_2024 - last_year_avg_money) AS absolute_increase,
       (((avg_money_2024 / last_year_avg_money) - 1) * 100) AS growth_rate_in_percentage
  FROM cte
 WHERE cte.year = 2024 
'''

select(sql)

,month,avg_money_2024,avg_money_2023,absolute_increase,growth_rate_in_percentage
0,1,12489.76,12437.14,52.62,0.423088
1,2,12489.05,12516.62,-27.57,-0.220267
2,3,12513.75,12488.19,25.56,0.204673
3,4,12523.29,12488.80,34.49,0.276167
4,5,12475.90,12507.41,-31.51,-0.251931
5,6,12496.21,12512.34,-16.13,-0.128913
6,7,12524.68,12488.95,35.73,0.286093
7,8,12481.03,12490.46,-9.43,-0.075498
8,9,12498.48,12486.81,11.67,0.093459
9,10,12509.31,12514.40,-5.09,-0.040673

Данную задачу можно решить без применения оконных функций, с помощью джойнов по месяцу двух подзапросов с отобранными по году данными.

In [20]:
# 2ой вариант  ❌
# Подзапрос 1 для вычисления среднего значения total_price за 2024 год
# Подзапрос 2 для вычисления среднего значения total_price за предыдущий 2023 год

sql = ''' 

WITH avg_2024 AS (
SELECT 
CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) AS month,
ROUND(AVG(total_price), 2) AS avg_money_2024
FROM orders
WHERE CAST(EXTRACT(YEAR FROM created_at) AS INTEGER) = 2024
GROUP BY month
),

avg_last_year AS (
SELECT 
CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) AS month,
ROUND(AVG(total_price), 2) AS last_year_avg_money
FROM orders
WHERE CAST(EXTRACT(YEAR FROM created_at) AS INTEGER) = 2023
GROUP BY month
)

SELECT 
a.month,
a.avg_money_2024,
l.last_year_avg_money,
(a.avg_money_2024 - l.last_year_avg_money) AS absolute_increase,
(((a.avg_money_2024 / l.last_year_avg_money) - 1) * 100) AS growth_rate_in_percentage
FROM avg_2024 a
LEFT JOIN avg_last_year l ON a.month = l.month
ORDER BY a.month;
'''

select(sql)

# Запрос с джойнами выполняет два подзапроса и затем объединяет результаты, что может быть менее эффективным для больших наборов данных.

,month,avg_money_2024,last_year_avg_money,absolute_increase,growth_rate_in_percentage
0,1,12489.76,12437.14,52.62,0.423088
1,2,12489.05,12516.62,-27.57,-0.220267
2,3,12513.75,12488.19,25.56,0.204673
3,4,12523.29,12488.80,34.49,0.276167
4,5,12475.90,12507.41,-31.51,-0.251931
5,6,12496.21,12512.34,-16.13,-0.128913
6,7,12524.68,12488.95,35.73,0.286093
7,8,12481.03,12490.46,-9.43,-0.075498
8,9,12498.48,12486.81,11.67,0.093459
9,10,12509.31,12514.40,-5.09,-0.040673

_______________________________________

4. Найти 10 пользователей, у которых наибольшее количество заказов за последний год, и для каждого из них найти средний размер заказа за последний месяц.  
Последний месяц: август 2024.

In [21]:
# 1 шаг. Найдём 10 юзеров с наибольшим количеством заказов за последний год 
# 2 шаг. Получив необходимый список юзеров, отберём их из основных данных с помощью INNER JOIN. 
# 3 шаг. Узнаем имя и email этих товарищей, присоединив таблицу users.

sql = ''' 
WITH cte AS (SELECT 
                    user_id,
                    COUNT(DISTINCT id) AS cnt_orders
               FROM orders
              WHERE EXTRACT(YEAR FROM created_at) = 2024
              GROUP BY 1
              ORDER BY 2 DESC
              LIMIT 10) -- 1 шаг


SELECT  
       TO_CHAR(DATE_TRUNC('month', o.created_at), 'YYYY-MM') AS month,
       o.user_id,
       u.name,
       u.email,
       AVG(o.total_price) AS avg_order_size
FROM orders o 
     INNER JOIN cte 
        ON o.user_id = cte.user_id --2 шаг
     INNER JOIN  users u 
        ON cte.user_id = u.id --3 шаг
     WHERE DATE_TRUNC('month', o.created_at) = DATE '2024-08-01'
GROUP BY 1, 2, 3, 4

            '''
select(sql)

,month,user_id,name,email,avg_order_size
0,2024-08,2272629,Timothy Ward,timothy.ward2272628@googlyandex.com,13457.105263

________________________________________________

In [22]:
# После использования соединения с базой данных через SQLAlchemy, 
# рекомендуется явно закрывать соединение, чтобы освободить ресурсы. 
conn.dispose()